Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/extbrowser-omegat.tmx
Source language: en_us
Languages: pt_br

source: External HTML Browser
pt_br: tNavegador HTML externo

source: The External Browser module enables the integration of external web browsers with the IDE for viewing Javadoc documentation and testing applets and web (JSP and servlet) applications.
pt_br: O módulo de navegação externa habilita a integração de navegadores web com o IDE para a visualização de documentação Javadoc e teste de applets e aplicações web (JSP e servlet).

source: It provides an alternative to the built-in HTML Browser.
pt_br: Fornece uma alternativa ao navegador HTML interno.

source: Enables integration of external web browsers with the IDE.
pt_br: Habilita a integração de navegadores web externos com o IDE.

source: Running command {0}
pt_br: Executando comando {0}

source: Cannot execute {0}.
pt_br: Não pode executar {0}.

source: Check external browser configuration.
pt_br: Verificar configuração do navegador externo.

source: Starting browser...
pt_br: Iniciando navegador...

source: Activating browser...
pt_br: Ativando navegador...

source: URL Sent to browser
pt_br: URL enviado ao navegador

source: Browser Executable
pt_br: Navegador executável

source: Command for executing the browser.
pt_br: Comando para a execução do navegador.

source: Optimized for Mozilla browsers
pt_br: Otimizado para navegadores Mozilla

source: Optimized for Firefox browsers
pt_br: Otimizado para navegadores Firefox

source: HTML browser that is brought up in a separate process every time a URL is selected for display from within the IDE.
pt_br: O navegador HTML é executado em um processo separado cada vez que uma URL é selecionada para exibição dentro do IDE.

source: External Browser (command-line)
pt_br: Navegador externo (linha de comando)

source: Cannot create process.
pt_br: Não pôde criar processo.

source: Check the browser configuration.
pt_br: Verifica a configuração do navegador.

source: {URL} = URL of the page to be loaded by the web browser
pt_br: {URL} = URL da página à ser carregada pelo navegador web

source: Unable to locate extbrowser.dll library.
pt_br: Não foi possível localizar a biblioteca extbrowser.dll.

source: This library contains native code neceseary for using the external HTML browser on Windows platform.
pt_br: Esta biblioteca contém código nativo necessário para a utilização do navegador HTML externo na plataforma Windows.

source: Optimized for Internet Explorer
pt_br: Otimizado para Internet Explorer

source: Browser cannot be used on this platform.
pt_br: O navegador não pode ser usado nesta plataforma.

source: Could not access the URL through the external browser.
pt_br: Não foi possível acessar a URL através do navegador externo.

source: External Browser
pt_br: Navegador externo

source: Browser activation timeout
pt_br: Timeout ao ativar o navegador

source: Open URL timeout
pt_br: Timeout ao abrir URL

source: DDE server timeout for WWW_Activate topic
pt_br: Timeout do servidor DDE para o tópico WWW_Activate

source: DDE server timeout for WWW_OpenUrl topic
pt_br: Timeout do servidor DDE para abrir o tópico WWW_OpenUrl

source: <Default System Browser>
pt_br: <Navegador padrão do sistema>

source: HTML browser using Windows registry to execute the right system-default browser.
pt_br: Navegador HTML usando o registro do Windows para executar o navegador padrão correto do sistema.

source: Timeout for launching the browser process
pt_br: Timeout ao lançar o processo do navegador

source: Sets the amount of time IDE waits for a browser process to launch.
pt_br: Define o tempo que o IDE espera pelo lançamento de um processo do navegador.

source: Optimized for Netscape browsers
pt_br: Otimizado para navegadores Netscape
